# I четверть. Итоговая работа
***
Этот репозиторий создан для презентации итоговой работы по основному блоку

## ЧТО ДОЛЖНО БЫТЬ В ЭТОМ ФАЙЛЕ

Оформленное текстовое описание решения задачи

### Задача для программы

>_Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами._

Примеры:

[“Hello”, “2”, “world”, “:-)”] → [“2”, “:-)”]

[“1234”, “1567”, “-2”, “computer science”] → [“-2”]

[“Russia”, “Denmark”, “Kazan”] → [ ]

## Текстовое описание решения

1. Создать возвратный строковый метод получения нескольких строк от пользователя. 
   >Используется запрос на ввод строк с клавиатуры через запятую с пробелом
2. Вывести на экран первоначально введенные пользователем строки в формате, приближенном к примеру к задаче. 
    >Выбран метод Console.Write и ($"{}")
3. Создать возвратный метод строкового массива, который преобразует введеные строки в строковый массив.
   >Выбран метод string.Split. В качестве разделителя выбраны запятая с пробелом, так как в таком формате пользователю предлагалось на первом этапе ввести данные
4. Создать финальный метод строкового массива, который (в соответствии с задачей) из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам.
   > Используются : 
   >* второй пустой строковый массив
   >* числовая переменная для работы с индексами нового массива
   >* метод Array.Resize для наполнения нового массива 
    
5. Вывести на экран результат задачи
   >Выбран метод String.Join

